Repository: huwung/ProjektOmegaT
Catalog: english2svenska/engliska2svenska-level2.tmx
Source language: en
Languages: sv

source: 10 kilometer
sv: ett längdmått

source: business has already got under way on a small scale
sv: verksamheten har redan startat så smått

source: compositions: hydrogen bomb experiment.
sv: Sammansättningar: vätebombsexperiment.

source: experimental.
sv: experimentell.

source: he is a good deal younger than his brother
sv: han är åtskilligt yngre än sin bror

source: he might come, and then again he might not.
sv: han kanske kommer, men å andra sidan kanske han inte gör det.

source: hydrogen bomb experiment.
sv: vätebombsexperiment.

source: in advance
sv: i förskott

source: intellectual experiment.
sv: tankeexperiment.

source: many people are against medical experiments on humans.
sv: många är emot medicinska experiment på människor.

source: quite exotic
sv: smått exotisk
